       01 WS-SAL-ERRORES.
            05 WS-SAL-ERRORES-REG                       PIC X(99).
            05 WS-SAL-ERRORES-COD-ERR                   PIC X(20).
            05 WS-SAL-ERRORES-DES-ERR                   PIC X(40).
